In [47]:
# The code was removed by Watson Studio for sharing.

,NEIGHBORHOOD,ADDRESS,ZIP CODE,GROSS SQUARE FEET,YEAR BUILT,SALE PRICE,SALE DATE,SALE DATE.1
0,BATHGATE,4445 PARK AVENUE,10457.0,1497.0,1899.0,388500,2019-07-23,bronx
1,BATHGATE,1948 BATHGATE AVENUE,10457.0,2047.0,1901.0,470000,2019-03-08,bronx
2,BATHGATE,2075 BATHGATE AVENUE,10457.0,1344.0,1899.0,420000,2019-05-24,bronx
3,BAYCHESTER,1137 EAST 213 STREET,10469.0,1637.0,1945.0,300000,2019-10-16,bronx
4,BAYCHESTER,1409 OAKLEY STREET,10469.0,1395.0,1935.0,325000,2019-05-03,bronx

#drop columns

In [19]:
droped_data = df_data_0.drop(columns=['ADDRESS', 'ZIP CODE','YEAR BUILT','SALE DATE'])
droped_data.head(10)

  NEIGHBORHOOD  GROSS SQUARE FEET  SALE PRICE SALE DATE.1
0     BATHGATE             1497.0      388500       bronx
1     BATHGATE             2047.0      470000       bronx
2     BATHGATE             1344.0      420000       bronx
3   BAYCHESTER             1637.0      300000       bronx
4   BAYCHESTER             1395.0      325000       bronx
5   BAYCHESTER             1690.0      460000       bronx
6   BAYCHESTER             1690.0      500000       bronx
7   BAYCHESTER             1648.0      465000       bronx
8   BAYCHESTER             1024.0      404250       bronx
9   BAYCHESTER             1764.0      498200       bronx

#make data frame that include colum price per feet data

In [20]:
droped_data['BOROUGH'] = droped_data['SALE DATE.1']
df_ppf = pd.DataFrame(data=droped_data['SALE PRICE'] / droped_data['GROSS SQUARE FEET'])
df_ppf = df_ppf.round(2)

droped_data['price_per_feet'] = df_ppf[0]
droped_data = droped_data[droped_data['price_per_feet'] <= 5000]
droped_data.head(10)

,NEIGHBORHOOD,GROSS SQUARE FEET,SALE PRICE,SALE DATE.1,BOROUGH,price_per_feet
0,BATHGATE,1497.0,388500,bronx,bronx,259.52
1,BATHGATE,2047.0,470000,bronx,bronx,229.60
2,BATHGATE,1344.0,420000,bronx,bronx,312.50
3,BAYCHESTER,1637.0,300000,bronx,bronx,183.26
4,BAYCHESTER,1395.0,325000,bronx,bronx,232.97
5,BAYCHESTER,1690.0,460000,bronx,bronx,272.19
6,BAYCHESTER,1690.0,500000,bronx,bronx,295.86
7,BAYCHESTER,1648.0,465000,bronx,bronx,282.16
8,BAYCHESTER,1024.0,404250,bronx,bronx,394.78
9,BAYCHESTER,1764.0,498200,bronx,bronx,282.43

data frame groupby BOROUGH

In [43]:
grouped_df = droped_data.groupby('BOROUGH').mean()
grouped_df.head(10)

              GROSS SQUARE FEET    SALE PRICE  price_per_feet
BOROUGH
Brooklyn            1635.257504  9.594249e+05      582.972912
Manhattan          16799.850000  1.694605e+07     1713.724143
bronx               1621.361570  5.433929e+05      346.618306
queens              2659.183195  6.752716e+05      271.142093
statenisland        1603.758827  5.826481e+05      393.822229

## make dataframe that include only relevant data(BOROUGH and price per feet)

In [46]:
#I maked new DF becouse i fail with optimize it by code:

price_df = pd.DataFrame({
    'BOROUGH':['Brooklyn','Manhattan','bronx','queens','statenisland'],
    'PRICE_PER_FEET':[582.97,1713.72,346.61,271.14,393.82]
})
price_df.head()

        BOROUGH  PRICE_PER_FEET
0      Brooklyn          582.97
1     Manhattan         1713.72
2         bronx          346.61
3        queens          271.14
4  statenisland          393.82